<?php

function privateInfoData1(){
	echo"
	<ul class='lh15'>
	<li class='bo'>■ 수집하는 개인정보의 항목</li>
	<li class='pt10'>회사는 회원서비스를 위하여 이용자들에게 맞춤식 서비스를 비롯한 보다 더 향상된 양질의 서비스를 제공하기 위하여 이용자 개인의 정보를 수집하고 있습니다.</li>
	<li><필수항목></li>
	<li class='pl10'>- 성명 , 아이디, 비밀번호, 주민등록번호 : 회원제 서비스 이용에 따른 본인 확인 절차에 이용</li>
	<li class='pl10'>- 이메일주소, 전화번호 : 고지사항 전달, 불만처리 등을 위한 원활한 의사 소통 경로의 확보, 새로운 서비스 및 신상품이나 이벤트 정보 등의 안내</li>
	<li class='pl10'>- 신용카드정보 : 서비스 및 부가 서비스 이용에 대한 요금 결제</li>
	<li class='pl10'>- 주소, 전화번호 : 청구서, 물품배송시 정확한 배송지의 확보</li>
	<li class='pl10'>- IP Address : 불량회원의 부정 이용 방지와 비인가 사용 방지</li>
	<li><선택항목></li>
	<li>개인맞춤 서비스를 제공하기 위하여 회사가 필요로 하는 정보</li>
	</ul>
	";
}


function privateInfoData2(){
	echo "
	<ul class='lh15'>
	<li class='bo'>■ 개인정보의 수집 및 이용목적</li>
	<li class='pt10'>가. 신규 서비스의 개발</li>
	<li>이용자들이 제공한 개인정보를 바탕으로 보다 더 유용한 서비스를 개발할 수 있습니다. 회사는 신규 서비스 개발이나 컨텐츠의 확충 시에 기존 이용자들이 회사에 제공한 개인정보를 바탕으로 개발해야 할 서비스의 우선 순위를 보다 더 효율적으로 정하고, 회사는 이용자들이 필요로 할 컨텐츠를 합리적으로 선택하여 제공할 수 있습니다.</li>
	<li class='pt10'>나. 회원관리</li>
	<li>회원제 서비스 이용에 따른 본인확인, 개인 식별, 불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인, 연령확인, 만14세 미만 아동 개인정보 수집 시 법정 대리인 동의여부 확인, 불만처리 등 민원처리, 고지사항 전달</li>
	<li class='pt10'>다. 마케팅 및 광고에 활용</li>
	<li>신규 서비스 개발과 이벤트 행사에 따른 정보 전달 및 맞춤 서비스 제공, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계</li>
	</ul>
	";
}


function privateInfoData3(){
	echo "
	<ul class='lh15'>
	<li class='bo'>■ 개인정보의 보유 및 이용기간</li>
	<li class='pt10'>회사는 이용자의 개인정보를 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.</li>
	<li>가. 회사의 내부방침에 의한 정보보유 사유</li>
	<li class='pl10'>-보존이유 : 불량이용자의 재가입방지 및 명예훼손 등 권리침해 분쟁 및 수사협조</li>
	<li class='pl10'>-보존기간 : 이용해지일로부터 1년</li>
	<li class='pt10'>나. 관련법령에 의한 정보보유 사유</li>
	<li>회사는 상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우, 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 회사는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.</li>
	<li class='pl10'>- 계약 또는 청약철회 등에 관한 기록 : 5년(전자상거래 등에서의 소비자보호에 관한 법률)</li>
	<li class='pl10'>- 대금결제 및 재화 등의 공급에 관한 기록 : 5년(전자상거래 등에서의 소비자보호에 관한 법률)</li>
	<li class='pl10'>- 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년(전자상거래 등에서의 소비자보호에 관한 법률)</li>
	<li class='pl10'>- 본인확인에 관한 기록 : 6개월(정보통신망 이용촉진 및 정보보호 등에 관한 법률)</li>
	<li class='pl10'>- 방문(로그)에 관한 기록 : 3개월(통신비밀보호법)</li>
	</ul>
	";
}

?>
