<?php
function provisionData(){
	

echo"
제 1 장 총칙
<br/>
<br/>
제 1 조 목적
<br/>
이 약관은 (주)피에이치피스쿨닷컴(이하 “회사”라 한다)이 제공하는 정보제공 및 구인, 구직 등의 취업서비스 피에치피스쿨(이하 “서비스”라 한다)의 이용조건 및 절차에 관한 사항을 규정함을 목적으로 합니다.
<br/>
<br/>
제 2 조 (정의)
<br/>
1. “피에이치피스쿨”이라 함은 웹 프로그래밍 언어 php(PHP: Hypertext Preprocessor)를 사용하는 이용자들의 php 관련 정보제공 및 구인, 구직 등의 취업서비스를 제공하는 웹사이트를 의미한다.
<br/>
2. “회원”이라 함은 서비스를 이용하고자 회사가 요구하는 정보를 기재하고, 이 약관에 동의한 개인 또는 법인을 의미합니다.
<br/>
3. “개인회원”이라 함은 서비스제공자가 제공하는 구직자 서비스를 이용하고자 회원가입절차를 완료하고 회사의 회원가입 승인을 취득한 개인을 말합니다.
<br/>
4. “기업회원”이라 함은 서비스제공자가 제공하는 기업서비스를 이용하고자 회원가입절차를 완료하고 회사의 회원가입 승인을 취득한 기업을 말하며, 가입 서비스 종류 및 기업의 선택에 따라 회원이 등급이 변경될 수 있습니다.
<br/>
5. “이용자”라 함은 피에이치피스쿨(www.phpschool.com)에 접속하여 회사가 제공하는 서비스를 받는 회원 또는 비회원을 의미합니다.
<br/>
6. “아이디(ID)”라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자와 숫자의 조합을 의미합니다.
<br/>
7. “비밀번호(Password)”라 함은 회원이 부여 받은 아이디와 일치되는 회원임을 확인하고, 회원이 자신의 비밀보호를 위해 정한 문자 또는 숫자의 조합을 의미합니다.
<br/>
<br/>
제 3 조 약관의 효력 및 변경
<br/>
1. 이 약관은 서비스를 통하여 이를 공지하거나 전자우편, 기타의 방법으로 이용자에게 공지함으로써 약관 시행일로부터 그 효력이 발생합니다.
<br/>
2. 회사는 이 약관을 변경할 수 있으며, 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 회사의 서비스 초기화면에 적용일 7일전부터 적용일자 전일까지 게시하는 방법으로 그 내용을 공지합니다.
<br/>
3. 이용자가 변경된 약관에 동의하지 아니하는 경우에는 서비스의 이용을 차단할 수 있으며, 계속 사용의 경우에는 본 약관의 변경내용에 동의한 것으로 간주됩니다.
<br/>
<br/>
제 4 조 약관외 준칙
<br/>
이 약관에서 정하지 않은 사항과 이 약관의 해석에 관하여는 온라인디지털콘텐츠산업발전법, 전자상거래등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률, 기타 관계법령의 규정에 따릅니다.
<br/>
<br/>
제 2 장 회원가입
<br/>
<br/>
제 5 조 (회원가입신청)
<br/>
1. 회원가입은 이용자의 회원가입신청 및 이 약관과 회사의 개인정보취급방침에 대한 동의의 표시로써 이루어집니다.
<br/>
2. 회원가입은 아이디(ID) 단위로 신청하는 것을 원칙으로 하며, 이용자는 회원가입시 실명인증 및 서비스의 원활한 운영을 위하여 회사가 요청하는 아래의 필수입력사항들에 대하여 기재하여야 합니다. 그 외의 정보들은 선택사항으로 합니다.
<br/>
가. 성명
<br/>
나. 주민등록번호
<br/>
다. 아이디(ID)
<br/>
라. 비밀번호
<br/>
마. 이메일(E-mail)
<br/>
바. 전화번호
<br/>
3. 회사는 필요한 경우 위2항의 내용 이외에도 새로운 내용을 추가할 수 있습니다.
<br/>
4. 회사는 이용자가 회원가입시 기재한 모든 정보가 사실인 것으로 간주합니다. 이에 고의?과실 여부와 상관없이 허위의 정보를 기재한 이용자는 법적인 보호를 받을 수 없을 뿐 아니라, 회사의 서비스 제공을 제한 받으실 수 있습니다.
<br/>
<br/>
제 6 조 (회원가입신청에 대한 승낙 및 거부)
<br/>
1. 회사는 제5조의 회원가입신청에 대하여 특별한 사정이 없는 한 접수순서에 따라 이를 승낙합니다.
<br/>
2. 회사는 다음 각 호에 해당하는 경우 회원가입신청에 대한 승낙을 제한할 수 있고, 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
<br/>
가. 서비스 관련 설비의 용량이 부족한 경우
<br/>
나. 기술상 장애사유가 있는 경우
<br/>
다. 가입신청자가 본 약관 제8조2항에 의거하여 이전에 회원 자격을 상실한 적이 있는 경우
<br/>
라. 등록내용에 허위, 기재누락, 오기가 있는 경우
<br/>
마. 기타 회사가 필요하다고 인정되는 경우
<br/>
3. 만 14세 미만의 미성년자는 반드시 법정대리인(부모)의 가입동의를 받아야 정상적인 서비스 이용이 가능하며, 법정대리인의 가입동의 의사표시는 이메일(E-mail), 팩스, 전화, 우편 등의 방법을 이용할 수 있습니다.
<br/>
4. 만 20세 미만의 미성년자는 유료 콘텐츠 이용 전에 반드시 법정대리인(부모)의 유료 콘텐츠 이용에 관한 동의를 받아야 정상적인 콘텐츠의 구매가 가능하며, 법정대리인의 유료 콘텐츠 이용에 관한 동의 의사표시는 이메일(E-mail), 팩스 (02-2026-5314), 전화, 우편 등의 방법을 이용할 수 있습니다.
<br/>
<br/>
제 7 조 (회원정보의 변경)
<br/>
회원은 언제든지 서비스를 이용하여 자신의 가입 정보들을 변경할 수 있습니다.
<br/>
<br/>
제 8 조 (회원 탈퇴 및 자격상실)
<br/>
1. 회원은 회사에 언제든지 탈퇴를 요청할 수 있으며, 회원의 탈퇴요청이 있을 시에 회사는 즉시 해당 회원을 탈퇴 처리합니다.
<br/>
2. 회사는 다음 각호에 해당하는 경우 회원의 자격을 제한 및 삭제할 수 있습니다.
<br/>
가. 회원가입 신청시 허위의 정보를 기재한 경우
<br/>
나. 설비에 여유가 없거나 기술상 지장이 있는 경우
<br/>
다. 기타 회사가 필요하다고 인정되는 경우
<br/>
<br/>
제 9 조 (회원에 대한 통지)
<br/>
1. 회사는 서비스 초기화면에 대한 공지, 회원이 가입신청 당시 기재한 이메일주소, 전화번호 등을 이용한 방법으로 회원에 통지할 수 있습니다.
<br/>
2. 회사는 불특정 다수에 대한 통지의 경우 서비스 초기 화면에 1주일간 해당 내용을 기재함으로써, 개별통지에 갈음할 수 있습니다.
<br/>
<br/>
제 3 장 서비스 종류 및 이용
<br/>
<br/>
제 10 조 (서비스 종류 및 변경)
<br/>
1. 회사가 제공하는 서비스의 종류는 아래와 같습니다.
<br/>
가. php 관련 정보의 제공
<br/>
나. 회원간의 커뮤니케이션 창구제공(글쓰기, 수정, 검색, 삭제, 쪽지보내기 등)
<br/>
다. 이력서 작성/저장/수정/인재DB에 이력서 등록
<br/>
라. 온라인 입사지원
<br/>
마. 기업의 스카우트 제의 서비스 (단, 이력서를 공개로 설정한 경우에 가능함)
<br/>
바. 맞춤채용정보 검색/등록
<br/>
사. 구인정보 스크랩
<br/>
아. 마감된 구인정보 검색
<br/>
자. 기타 “서비스제공자”가 자체 개발하거나 다른 회사와의 협력계약 등을 통해 “회원”들에게 제공할 일체의 서비스
<br/>
2. 회사가 제공하는 서비스의 종류는 회사의 경영 정책상 변경할 수 있으며, 변경된 내용은 제9조의 방법으로 공지합니다.
<br/>
<br/>
제 11 조 (서비스 이용)
<br/>
1. 서비스 이용은 회사가 회원의 가입신청을 승낙한 때로부터 즉시 가능해집니다. 단, 제13조에 한하여 그 시점이 연기될 수 있습니다.
<br/>
2. 서비스의 이용시간은 회사의 업무상 또는 기술상 장애, 기타 특별한 사유가 없는 한 연중 무휴, 1일 24시간 이용할 수 있습니다. 단, 제13조에 한하여 이용을 제한할 수 있습니다.
<br/>
<br/>
제 12 조 (서비스 이용 요금)
<br/>
1. 회사의 서비스는 유료와 무료로 구분이 가능하며, 유료 서비스의 경우 해당 요금의 세부내역은 서비스내에 별도 명기합니다.
<br/>
2. 서비스 이용 요금은 회사의 정책에 의하여 변경될 수 있습니다.
<br/>
<br/>
제 13 조 (서비스 제공의 중지)
<br/>
회사는 아래 각 호에 해당하는 경우 서비스의 일부 혹은 전부의 제공을 중지할 수 있습니다.
<br/>
가. 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
<br/>
나. 전기통신사업법에 규정된 기간통신사업자가 전기통신서비스를 중지했을 경우
<br/>
다. 국가비상사태, 정전, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 때
<br/>
라. 네트워크상의 위험성에 기초한 타인의 서비스 제공 음해 행위가 있는 때
<br/>
<br/>
제 4 장 개인정보보호 및 저작권
<br/>
<br/>
제 14 조 (이용자의 개인정보보호)
<br/>
1. 회사는 서비스 이용자의 정보 수집 시 반드시 당해 이용자의 동의를 얻어 필요한 최소한의 정보만을 수집하며, 이용자는 온라인을 통해서 수시로 본인의 신상정보를 열람, 정정 또는 삭제할 수 있습니다.
<br/>
2. 회사는 이용자의 개인 신상정보를 본인의 동의 없이는 절대 제3자에게 제공, 분실 또는 유출하여서는 안되며 이를 지키지 않아서 발생하는 이용자의 모든 피해에 대한 책임은 회사에 있습니다. 단, 다음과 같은 경우에는 예외로 합니다.
<br/>
가. 전기통신기본법 등 관계법령에 의하여 국가기관 등의 요구가 있는 경우
<br/>
나. 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우
<br/>
다. 배송 업무상 배송 업체에 고객의 정보를 알려주는 경우
<br/>
라. 은행업무상 관련사항에 한하여 일부 정보를 공유하는 경우
<br/>
마. 특정인을 식별할 수 없는 통계작성, 홍보자료, 학술연구 등의 목적인 경우
<br/>
바. 이용자의 동의 없이 개인정보가 유출되는 등 부당한 사례를 발견했을 때에는 전화 02-2627-6637, 이메일(E-mail) : desk@phpschool.com, 한국소비자보호원, 경실련 등을 통해 신고할 수 있으며, 이에 대해 회사는 적절한 조치를 취할 의무가 있습니다
<br/>
3. “회사”는 “서비스”에 등록된 회원의 ID와 이력서 정보(이름,주소,연락처등 모두 포함)를 관리합니다.
<br/>
4. “회사”는 회원이 이력서 입력 시 비공개로 설정한 경우에는 절대 외부로 노출하지 않습니다.
<br/>
<br/>
제 15 조 (회사의 의무)
<br/>
1. “회사”는 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 본 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하기 위해서 노력합니다.
<br/>
2.. “회사”는 “회원”이 안전하게 서비스를 이용할 수 있도록 “회원”의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 구축합니다.
<br/>
3. “회사”는 “회원”이 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.
<br/>
<br/>
제 16 조 (저작권의 귀속 및 이용제한)
<br/>
1. 회사가 작성한 저작물에 대한 저작재산권은 회사에 있습니다.
<br/>
2. 이용자는 서비스를 이용함에 있어 취득한 정보를 회사의 사전 승낙 없이 제3자에게 제공하거나, 복제, 출판 등의 방법으로 배포할 수 없습니다.
<br/>
<br/>
제 5 장 손해배상 및 면책조항
<br/>
<br/>
제 17 조 (손해배상)
<br/>
1. 회사는 무료인 서비스와 정보 서비스 이용과 관련하여 이용자에게 발생한 어떠한 손해도 책임지지 않습니다.
<br/>
2. 회사는 유료인 서비스의 이용과 관련하여 발생하는 이용자의 손해에 대하여 관계법령이 정하는 한도내에서 배상책임을 집니다. 단, 이용자의 과실이 있는 경우에는 해당 부분에 대한 책임이 면제됩니다.
<br/>
<br/>
제 18 조 (연결서비스와 피연결서비스간의 관계)
<br/>
1. 상위 서비스와 하위 서비스가 링크(예: 링크의 대상에는 문자 및 그림 등이 포함됨)방식 등으로 연결된 경우, 전자를 연결 서비스(웹 사이트)이라고 하고 후자를 피연결서비스(웹사이트)라고 합니다.
<br/>
2. 연결서비스는 피연결서비스가 독자적으로 제공하는 재화?용역에 의하여 발생된 이용자와의 거래에 대해서 보증 책임을 지지 않습니다
<br/>
<br/>
제 19 조 (면책)
<br/>
1. 회사는 본 약관에서 달리 정한 것을 제외하고는 각 쇼핑몰에 게재된 어떠한 상품이나 정보에 대하여도 권한과 책임을 가지지 않습니다.
<br/>
2. 쇼핑몰 고객은 각 쇼핑몰에 게재된 상품정보를 스스로의 판단하에서 자유롭게 이용할 권리가 있습니다. 또한, 회사는 어떠한 경우라도 쇼핑몰 고객이 쇼핑몰에 게재된 상품정보에 의해 입은 손해에 대해 책임이 없습니다.
<br/>
3. 관리자가 회사와 제휴된 외부서비스를 이용하는 중, 외부 서비스 제공사의 일방적인 정책 변경에 따라 발생하는 관리자의 손해는 서비스 제공사에게 책임이 있으며, 이에 대해 회사는 면책됩니다.
<br/>
<br/>
제 6 장 기타사항
<br/>
<br/>
제 20 조 (개인정보 위탁처리)
<br/>
① 회사는 업무진행에 있어 필요에 의하여 고객정보 처리를 외부기관에 위탁 처리하고 있습니다.
<br/>
② 회사는 수탁 업체에게 고객의 민원사항 처리를 위해 필요한 범위 내에서 정보를 제공할 수 있으며, 회사의 개인정보보호정책을 준수할 수 있는 자를 수탁자로 선정합니다.
<br/>
③ 회사는 위탁계약서상의 회사의 개인정보보호 관련 지시엄수, 개인정보에 관한 비밀유지, 제3자 제공의 금지, 사고시의 책임 및 손해배상 등에 대한 사항을 명확히 규정하고 당해 계약내용을 서면 또는 전자적 기록으로 보존하여야 합니다.
<br/>
<br/>
제 21 조 (권리의 양도금지)
<br/>
관리자는 회사의 서면동의 없이 본 약관상의 권리와 의무를 제3자에게 양도, 증여하거나 이를 담보로 제공할 수 없습니다.
<br/>
<br/>
제 22 조 (기타사항)
<br/>
① 이 약관에 규정되어 있지 아니한 사항은 관계 법령 및 일반적인 상관례에 따릅니다.
<br/>
② 이 약관으로 발생한 분쟁에 대하여 소송이 제기될 경우 서울중앙지방법원을 관할 법원으로 합니다.
<br/>
<br/>
<br/>
* 부칙
<br/>
이 약관은 2010년 2월 1일부터 시행합니다.
<br/>
";

}
?>